# https://github.com/Homebrew/homebrew-bundle

# personal prefs
brew "fzf"

cask "visual-studio-code"
cask "raycast"

# tools management
brew "mise"

# mostly devops stuff
brew "awscli"
brew "kubectl"
brew "k9s"
brew "helm"
brew "jq"
brew "kustomize"
brew "sops"
brew "yq"
brew "fluxcd/tap/flux"

# Fira Code https://github.com/tonsky/FiraCode
cask "font-fira-code"

# github and gitlab clis
brew "gh"
brew "glab"

# https://taskfile.dev/
brew "go-task"
